#+title: Appaloosa ZSH


** Startup-Time

#+begin_src shell :results output :exports both
hyperfine -- '$SHELL -i -c exit'
#+end_src

#+RESULTS:
: Benchmark #1: $SHELL -i -c exit
:   Time (mean ± σ):      64.1 ms ±   1.0 ms    [User: 39.6 ms, System: 28.3 ms]
:   Range (min … max):    62.8 ms …  67.0 ms    45 runs

** Startup Profiling
